Lotlab/nrf51822-keyboard/main.c
/**@brief Function for handling advertising errors.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void ble_advertising_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

static void keyboard_scan_timeout_handler(void *p_context);
static void keyboard_sleep_timeout_handler(void *p_context);
/**@brief 计时器初始化函数
 *
 * @details Initializes the timer module.
 */
static void timers_init(void)
{
    uint32_t err_code;

    // Initialize timer module, making it use the scheduler.
    APP_TIMER_APPSH_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, true);

    err_code = app_timer_create(&m_keyboard_scan_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                keyboard_scan_timeout_handler);

    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&m_keyboard_sleep_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                keyboard_sleep_timeout_handler);

    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    uint32_t err_code;
    ble_gap_conn_params_t gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);
    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_HID_KEYBOARD);
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_tx_power_set(-4);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing Device Information Service.
 */
static void dis_init(void)
{
    uint32_t err_code;
    ble_dis_init_t dis_init_obj;
    ble_dis_pnp_id_t pnp_id;

    pnp_id.vendor_id_source = PNP_ID_VENDOR_ID_SOURCE;
    pnp_id.vendor_id = PNP_ID_VENDOR_ID;
    pnp_id.product_id = PNP_ID_PRODUCT_ID;
    pnp_id.product_version = PNP_ID_PRODUCT_VERSION;

    memset(&dis_init_obj, 0, sizeof(dis_init_obj));

    ble_srv_ascii_to_utf8(&dis_init_obj.manufact_name_str, MANUFACTURER_NAME);
    dis_init_obj.p_pnp_id = &pnp_id;

    BLE_GAP_CONN_SEC_MODE_SET_ENC_NO_MITM(&dis_init_obj.dis_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&dis_init_obj.dis_attr_md.write_perm);

    err_code = ble_dis_init(&dis_init_obj);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing HID Service.
 */
static void hids_init(void)
{
    uint32_t err_code;
    ble_hids_init_t hids_init_obj;
    ble_hids_inp_rep_init_t input_report_array[1];
    ble_hids_inp_rep_init_t *p_input_report;
    ble_hids_outp_rep_init_t output_report_array[1];
    ble_hids_outp_rep_init_t *p_output_report;
    uint8_t hid_info_flags;

    memset((void *)input_report_array, 0, sizeof(ble_hids_inp_rep_init_t));
    memset((void *)output_report_array, 0, sizeof(ble_hids_outp_rep_init_t));

    static uint8_t report_map_data[] =
        {
            0x05, 0x01, // Usage Page (Generic Desktop)
            0x09, 0x06, // Usage (Keyboard)
            0xA1, 0x01, // Collection (Application)
            0x05, 0x07, //     Usage Page (Key Codes)
            0x19, 0xe0, //     Usage Minimum (224)
            0x29, 0xe7, //     Usage Maximum (231)
            0x15, 0x00, //     Logical Minimum (0)
            0x25, 0x01, //     Logical Maximum (1)
            0x75, 0x01, //     Report Size (1)
            0x95, 0x08, //     Report Count (8)
            0x81, 0x02, //     Input (Data, Variable, Absolute)

            0x95, 0x01, //     Report Count (1)
            0x75, 0x08, //     Report Size (8)
            0x81, 0x01, //     Input (Constant) reserved byte(1)

            0x95, 0x05, //     Report Count (5)
            0x75, 0x01, //     Report Size (1)
            0x05, 0x08, //     Usage Page (Page# for LEDs)
            0x19, 0x01, //     Usage Minimum (1)
            0x29, 0x05, //     Usage Maximum (5)
            0x91, 0x02, //     Output (Data, Variable, Absolute), Led report
            0x95, 0x01, //     Report Count (1)
            0x75, 0x03, //     Report Size (3)
            0x91, 0x01, //     Output (Data, Variable, Absolute), Led report padding

            0x95, 0x06, //     Report Count (6)
            0x75, 0x08, //     Report Size (8)
            0x15, 0x00, //     Logical Minimum (0)
            0x25, 0x65, //     Logical Maximum (255)
            0x05, 0x07, //     Usage Page (Key codes)
            0x19, 0x00, //     Usage Minimum (0)
            0x29, 0x65, //     Usage Maximum (101)
            0x81, 0x00, //     Input (Data, Array) Key array(6 bytes)

            0x09, 0x05,       //     Usage (Vendor Defined)
            0x15, 0x00,       //     Logical Minimum (0)
            0x26, 0xFF, 0x00, //     Logical Maximum (255)
            0x75, 0x08,       //     Report Count (2)
            0x95, 0x02,       //     Report Size (8 bit)
            0xB1, 0x02,       //     Feature (Data, Variable, Absolute)

            0xC0 // End Collection (Application)
        };

    // Initialize HID Service
    p_input_report = &input_report_array[INPUT_REPORT_KEYS_INDEX];
    p_input_report->max_len = INPUT_REPORT_KEYS_MAX_LEN;
    p_input_report->rep_ref.report_id = INPUT_REP_REF_ID;
    p_input_report->rep_ref.report_type = BLE_HIDS_REP_TYPE_INPUT;

    BLE_GAP_CONN_SEC_MODE_SET_ENC_NO_MITM(&p_input_report->security_mode.cccd_write_perm);
    BLE_GAP_CONN_SEC_MODE_SET_ENC_NO_MITM(&p_input_report->security_mode.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_ENC_NO_MITM(&p_input_report->security_mode.write_perm);

    p_output_report = &output_report_array[OUTPUT_REPORT_INDEX];
    p_output_report->max_len = OUTPUT_REPORT_MAX_LEN;
    p_output_report->rep_ref.report_id = OUTPUT_REP_REF_ID;
    p_output_report->rep_ref.report_type = BLE_HIDS_REP_TYPE_OUTPUT;

