Lotlab/nrf51822-keyboard/main.c
/**@brief 初始化程序所需的服务
 */
static void services_init(void)
{
    dis_init();
    hids_init();
#ifdef BLE_DFU_APP_SUPPORT
    dfu_init();
#endif // BLE_DFU_APP_SUPPORT
}

static bool keyboard_conn_pass_enter_handler(const uint8_t *key_packet, uint8_t key_packet_size)
{
    if (passkey_enter_index < 6)
    {
        for (uint_fast8_t i = 0; i < key_packet_size; i++)
        {
            if (key_packet[i] >= KC_1)
            {
                if (key_packet[i] <= KC_0)
                {
                    passkey_entered[passkey_enter_index++] = (key_packet[i] + 1 - KC_1) % 10 + '0';
                }
                else if (key_packet[i] >= KC_KP_1 && key_packet[i] <= KC_KP_0)
                {
                    passkey_entered[passkey_enter_index++] = (key_packet[i] + 1 - KC_KP_1) % 10 + '0';
                }
            }
        }
        if (passkey_enter_index == 6)
        {
            sd_ble_gap_auth_key_reply(passkey_conn_handle, BLE_GAP_AUTH_KEY_TYPE_PASSKEY, passkey_entered);
        }
        return true;
    }
    else
    {
        return false;
    }
}

static void keyboard_switch_scan_mode(bool slow)
{
    uint32_t err_code;
    err_code = app_timer_stop(m_keyboard_scan_timer_id);
    if (slow)
        err_code = app_timer_start(m_keyboard_scan_timer_id, KEYBOARD_SCAN_INTERVAL_SLOW, NULL);
    else
        err_code = app_timer_start(m_keyboard_scan_timer_id, KEYBOARD_SCAN_INTERVAL, NULL);

    APP_ERROR_CHECK(err_code);
}

static void keyboard_sleep_timeout_handler(void *p_context)
{
    sleep_counter++;
    if (sleep_counter == SLEEP_SLOW_TIMEOUT / SLEEP_DEVIDE)
    {
        keyboard_switch_scan_mode(true);
    }
    else if (sleep_counter == SLEEP_OFF_TIMEOUT / SLEEP_DEVIDE)
    {
        sleep_mode_enter();
    }
}

static void keyboard_sleep_counter_reset(void)
{
    if (sleep_counter >= SLEEP_SLOW_TIMEOUT / SLEEP_DEVIDE)
    {
        keyboard_switch_scan_mode(false);
    }

    sleep_counter = 0;
}

/**@brief Function for handling the keyboard scan timer timeout.
 *
 * @details This function will be called each time the keyboard scan timer expires.
 *
 */
static void keyboard_scan_timeout_handler(void *p_context)
{
    UNUSED_PARAMETER(p_context);
    const uint8_t *key_packet;
    uint8_t key_packet_size;
    if (new_packet(&key_packet, &key_packet_size))
    {
        keyboard_sleep_counter_reset();
        for (uint_fast8_t i = 0; i < key_packet_size; i++)
        {
            if (key_packet[i] == KC_FN15)
            {
                sleep_mode_enter();
            }
        }
        if (keyboard_conn_pass_enter_handler(key_packet, key_packet_size))
            return; // 处理配对密码输入事件
        if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
        {
            keys_send(key_packet_size, (uint8_t *)&key_packet[0]);
        }
    }
}

/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    uint32_t err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail = false;
    cp_init.evt_handler = NULL;
    cp_init.error_handler = conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}

/**@brief 计时器启动函数
 */
static void timers_start(void)
{
    uint32_t err_code;

    err_code = app_timer_start(m_keyboard_scan_timer_id, KEYBOARD_SCAN_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_start(m_keyboard_sleep_timer_id, KEYBOARD_FREE_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);

    battery_timer_start();
}

/**@brief   Function for transmitting a key scan Press & Release Notification.
 *
 * @warning This handler is an example only. You need to analyze how you wish to send the key
 *          release.
 *
 * @param[in]  p_instance     Identifies the service for which Key Notifications are requested.
 * @param[in]  p_key_pattern  Pointer to key pattern.
 * @param[in]  pattern_len    Length of key pattern. 0 < pattern_len < 7.
 * @param[in]  pattern_offset Offset applied to Key Pattern for transmission.
 * @param[out] actual_len     Provides actual length of Key Pattern transmitted, making buffering of
 *                            rest possible if needed.
 * @return     NRF_SUCCESS on success, BLE_ERROR_NO_TX_BUFFERS in case transmission could not be
 *             completed due to lack of transmission buffer or other error codes indicating reason
 *             for failure.
 *
 */
static uint32_t send_key_scan_press_release(ble_hids_t *p_hids,
                                            uint8_t *p_key_pattern,
                                            uint16_t pattern_len,
                                            uint16_t pattern_offset,
                                            uint16_t *p_actual_len)
{
    uint32_t err_code;
    for (int i = 0; i < pattern_len; i++)
    {
        switch (p_key_pattern[i])
        {
        case KC_NUMLOCK:
            m_led_state[OUTPUT_REPORT_BIT_MASK_NUM_LOCK] = !m_led_state[OUTPUT_REPORT_BIT_MASK_NUM_LOCK];
            nrf_gpio_pin_toggle(LED_NUM);
            break;
        case KC_CAPSLOCK:
            m_led_state[OUTPUT_REPORT_BIT_MASK_CAPS_LOCK] = !m_led_state[OUTPUT_REPORT_BIT_MASK_CAPS_LOCK];
            nrf_gpio_pin_toggle(LED_CAPS);
            break;
        case KC_SCROLLLOCK:
            m_led_state[OUTPUT_REPORT_BIT_MASK_SCROLL_LOCK] = !m_led_state[OUTPUT_REPORT_BIT_MASK_SCROLL_LOCK];
            nrf_gpio_pin_toggle(LED_SCLK);
            break;
        default:
            break;
        }
    }
    if (!m_in_boot_mode)
    {
        err_code = ble_hids_inp_rep_send(&m_hids,
                                         INPUT_REPORT_KEYS_INDEX,
                                         INPUT_REPORT_KEYS_MAX_LEN,
                                         p_key_pattern);
    }
    else
    {
        err_code = ble_hids_boot_kb_inp_rep_send(&m_hids,
                                                 INPUT_REPORT_KEYS_MAX_LEN,
                                                 p_key_pattern);
    }

    return err_code;
}

/**@brief   Function for initializing the buffer queue used to key events that could not be
 *          transmitted
 *
 * @warning This handler is an example only. You need to analyze how you wish to buffer or buffer at
 *          all.
 *
 * @note    In case of HID keyboard, a temporary buffering could be employed to handle scenarios
 *          where encryption is not yet enabled or there was a momentary link loss or there were no
 *          Transmit buffers.
 */
static void buffer_init(void)
{
    uint32_t buffer_count;

    BUFFER_LIST_INIT();

    for (buffer_count = 0; buffer_count < MAX_BUFFER_ENTRIES; buffer_count++)
    {
        BUFFER_ELEMENT_INIT(buffer_count);
    }
}

/**@brief Function for enqueuing key scan patterns that could not be transmitted either completely
 *        or partially.
 *
 * @warning This handler is an example only. You need to analyze how you wish to send the key
 *          release.
 *
 * @param[in]  p_hids         Identifies the service for which Key Notifications are buffered.
 * @param[in]  p_key_pattern  Pointer to key pattern.
 * @param[in]  pattern_len    Length of key pattern.
 * @param[in]  offset         Offset applied to Key Pattern when requesting a transmission on
 *                            dequeue, @ref buffer_dequeue.
 * @return     NRF_SUCCESS on success, else an error code indicating reason for failure.
 */
static uint32_t buffer_enqueue(ble_hids_t *p_hids,
                               uint8_t *p_key_pattern,
                               uint16_t pattern_len,
                               uint16_t offset)
{
    buffer_entry_t *element;
    uint32_t err_code = NRF_SUCCESS;

